zhaohad/KeilProjects/电子资料/stc/STC8A8K64D4-SOFTWARE-LIB/独立例程/23-UART收发数据自动存入BMM-串口输出结果/STC8A_BMM_Isr.c
/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include "STC8A_BMM.h"

//========================================================================
// 函数: BMM_ISR_Handler
// 描述: BMM中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2021-05-25
//========================================================================
void BMM_ISR_Handler (void) interrupt 13
{
	char store;
	
	store = P_SW2;
	P_SW2 |= 0x80;		//使能扩展SFR(XSFR)访问

	// TODO: 在此处添加用户代码
	//---------- BMM UART1 -------------
	if (BMM_UR1T_STA & 0x01)	//发送完成
	{
		BMM_UR1T_STA &= ~0x01;	//清标志位
		BmmTx1Flag = 1;
	}
	if (BMM_UR1T_STA & 0x04)	//数据覆盖
	{
		BMM_UR1T_STA &= ~0x04;	//清标志位
	}
	
	if (BMM_UR1R_STA & 0x01)	//接收完成
	{
		BMM_UR1R_STA &= ~0x01;	//清标志位
		BmmRx1Flag = 1;
	}
	if (BMM_UR1R_STA & 0x02)	//数据丢弃
	{
		BMM_UR1R_STA &= ~0x02;	//清标志位
	}
	//---------- BMM UART2 -------------
	if (BMM_UR2T_STA & 0x01)	//发送完成
	{
		BMM_UR2T_STA &= ~0x01;	//清标志位
		BmmTx2Flag = 1;
	}
	if (BMM_UR2T_STA & 0x04)	//数据覆盖
	{
		BMM_UR2T_STA &= ~0x04;	//清标志位
	}
	
	if (BMM_UR2R_STA & 0x01)	//接收完成
	{
		BMM_UR2R_STA &= ~0x01;	//清标志位
		BmmRx2Flag = 1;
	}
	if (BMM_UR2R_STA & 0x02)	//数据丢弃
	{
		BMM_UR2R_STA &= ~0x02;	//清标志位
	}
	//---------- BMM UART3 -------------
	if (BMM_UR3T_STA & 0x01)	//发送完成
	{
		BMM_UR3T_STA &= ~0x01;	//清标志位
		BmmTx3Flag = 1;
	}
	if (BMM_UR3T_STA & 0x04)	//数据覆盖
	{
		BMM_UR3T_STA &= ~0x04;	//清标志位
	}
	
	if (BMM_UR3R_STA & 0x01)	//接收完成
	{
		BMM_UR3R_STA &= ~0x01;	//清标志位
		BmmRx3Flag = 1;
	}
	if (BMM_UR3R_STA & 0x02)	//数据丢弃
	{
		BMM_UR3R_STA &= ~0x02;	//清标志位
	}
	//---------- BMM UART4 -------------
	if (BMM_UR4T_STA & 0x01)	//发送完成
	{
		BMM_UR4T_STA &= ~0x01;	//清标志位
		BmmTx4Flag = 1;
	}
	if (BMM_UR4T_STA & 0x04)	//数据覆盖
	{
		BMM_UR4T_STA &= ~0x04;	//清标志位
	}
	
	if (BMM_UR4R_STA & 0x01)	//接收完成
	{
		BMM_UR4R_STA &= ~0x01;	//清标志位
		BmmRx4Flag = 1;
	}
	if (BMM_UR4R_STA & 0x02)	//数据丢弃
	{
		BMM_UR4R_STA &= ~0x02;	//清标志位
	}

	P_SW2 = store;
}
